# Taps

tap "homebrew/cask-fonts"

# Brews

## install MacOS appstore CLI
brew "mas"
## GNU core utilities
### TODO: Update ZSH script https://github.com/mathiasbynens/dotfiles/blob/main/brew.sh#L15
brew "coreutils"
# Install more recent versions of some macOS tools.
brew "vim"
brew "grep"
brew "openssh"
brew "git"

brew "ripgrep"
brew "stow"
brew "fzf"
brew "bat"
brew "jq"
brew "yq"
brew "shellcheck"
brew "just"

# ASDF 
brew "asdf"
# nodejs deps
brew "gpg"
brew "gawk"

# Casks

cask "visual-studio-code"
cask "rectangle"
cask "firefox"
cask "bartender"
cask "iterm2"
cask "obsidian"
cask "istat-menus"

cask "font-fira-code-nerd-font"

cask "spotify"
cask "raindropio"
cask "docker"
cask "google-chrome"

# Mac App

mas "Fantastical", id: 975937182
mas "Clocker", id: 1056643111
mas "Xnip", id: 1221250572
